; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l6_p6_c6_g6_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 warehouse)
	(crate-at crate2 warehouse)
	(crate-at crate3 warehouse)
	(crate-at crate4 warehouse)
	(crate-at crate5 warehouse)
	(crate-at crate6 warehouse)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate medicine crate2)
	(content-crate medicine crate3)
	(content-crate medicine crate4)
	(content-crate medicine crate5)
	(content-crate medicine crate6)
	(person-at person1 loc2)
	(person-at person2 loc1)
	(person-at person3 loc6)
	(person-at person4 loc6)
	(person-at person5 loc2)
	(person-at person6 loc2)
	(person-need person2 medicine)
	(person-need person3 medicine)
	(person-need person4 medicine)
	(person-need person5 food)
	(person-need person5 medicine)
	(person-need person6 medicine)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person2 medicine)
	(has-content-person person3 medicine)
	(has-content-person person4 medicine)
	(has-content-person person5 food)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
))
)

; plan
1. (drone-move depot warehouse drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 warehouse)
   goals met: 0 of 7
2. (pick-up-crate crate1 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate1 warehouse)
   added: (has-crate-drone-arm drone1 right crate1)
   goals met: 0 of 7
3. (pick-up-crate crate2 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate2 warehouse)
   added: (has-crate-drone-arm drone1 left crate2)
   goals met: 0 of 7
4. (drone-move warehouse loc1 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc1)
   goals met: 0 of 7
5. (drone-move loc1 loc2 drone1)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 loc2)
   goals met: 0 of 7
6. (drop-crate loc2 person5 crate1 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate1)
   added: (has-content-person person5 food) (empty-arm drone1 right)
   goals met: 1 of 7
7. (drone-move loc2 loc1 drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 loc1)
   goals met: 1 of 7
8. (drop-crate loc1 person2 crate2 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate2)
   added: (has-content-person person2 medicine) (empty-arm drone1 left)
   goals met: 2 of 7
9. (drone-move loc1 warehouse drone1)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 warehouse)
   goals met: 2 of 7
10. (pick-up-crate crate3 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate3 warehouse)
   added: (has-crate-drone-arm drone1 right crate3)
   goals met: 2 of 7
11. (drone-move warehouse loc6 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 2 of 7
12. (drop-crate loc6 person3 crate3 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate3)
   added: (has-content-person person3 medicine) (empty-arm drone1 right)
   goals met: 3 of 7
13. (drone-move loc6 warehouse drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 7
14. (pick-up-crate crate4 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate4 warehouse)
   added: (has-crate-drone-arm drone1 right crate4)
   goals met: 3 of 7
15. (drone-move warehouse loc6 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 3 of 7
16. (drop-crate loc6 person4 crate4 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate4)
   added: (has-content-person person4 medicine) (empty-arm drone1 right)
   goals met: 4 of 7
17. (drone-move loc6 warehouse drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 7
18. (pick-up-crate crate5 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate5 warehouse)
   added: (has-crate-drone-arm drone1 right crate5)
   goals met: 4 of 7
19. (drone-move warehouse loc2 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 4 of 7
20. (drop-crate loc2 person5 crate5 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate5)
   added: (has-content-person person5 medicine) (empty-arm drone1 right)
   goals met: 5 of 7
21. (drone-move loc2 warehouse drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 7
22. (pick-up-crate crate6 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate6 warehouse)
   added: (has-crate-drone-arm drone1 right crate6)
   goals met: 5 of 7
23. (drone-move warehouse loc2 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 5 of 7
24. (drop-crate loc2 person6 crate6 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate6)
   added: (has-content-person person6 medicine) (empty-arm drone1 right)
   goals met: 6 of 7
25. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 7 of 7
